# MmCaret2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..MmCaret2 Property
SymbolTypeId Class See Also
---
Symbol mm^2, indicating unit Square millimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MmCaret2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MmCaret2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MmCaret2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace